# 游戏的脚本可置于此文件中。
# 声明此游戏使用的角色。颜色参数可使角色姓名着色。

define yt = Character("佐佐木 阳太")
define akn = Character("风见 茜")
define skr = Character("藤原 樱")
define aoi = Character("小早川 葵")
define ai = Character("雾岛 蓝")

define n = nvl_narrator

# 游戏在此开始。
# 其他设定：立绘所谓的平常标签“normal”，应该是略带微笑的表情，而none才是面无表情
# 如果立绘一点都找不着了，就把差分全删了

label start:
    jump chapter_1

label chapter_0:
    stop music
    "【序章:沙化的毕业季】"

    play music "图书馆.mp3"

    scene bg library
    "樱花盛开的3月份。"
    "随风飘落的樱花通过窗户进到了图书馆内。"
    "我上前想要把窗户关上。"
    show akane normal with dissolve
    akn "『开着吧，反正之后也会清理的』"
    show akane normal2 with dissolve #闭眼
    "被不知道什么时候在我身后的图书管理员阻止了。"
    hide akane with dissolve
    "风见茜是同班的图书管理员。"
    "我对她并没有什么印象，好像只有我找书的时候才会出现。"
    yt "『好的』"
    "为了避免尴尬，我顺手摆了摆靠窗桌子的位置。"
    show cherry_flower at truecenter with dissolve
    "但在我没注意到的时候，飘落在桌子上的樱花像灭霸打了响指一样消散了。"
    hide cherry_flower with Dissolve(2.0)
    yt "『是我眼花了吗？』"

    show akane question with dissolve
    akn "『阳太同学，这个点你怎么还在图书馆？』"
    yt "『啊，我是学生会成员，过来帮忙整理图书馆的』"
    "此乃谎言。"
    "其实我是想掐着点在图书馆偶遇学生会会长————藤原樱"
    "以便增进一下感情，顺便在图书馆找些情感偏方什么的。"
    "但很明显，她今天应该是不会来了。"
    akn "『快毕业了，学生会的工作不是停了吗？』"
    yt "『嗯……』"
    yt "『我还需要找书，抱歉』"
    akn "『什么类型的？』"
    "说实话，我非常不好意思说出自己想找《这样做就能永远在一起~★》之类的书。"
    "不，是超级不好意思！"
    yt "『啊啊……不用麻烦你了，我自己找就可以了』"
    show akane none with dissolve #无表情
    akn "『我需要早点下班，所以你只要告诉我就可以了。{nw}"
    show akane interesting with dissolve #饶有趣味
    akn "『我需要早点下班，所以你只要告诉我就可以了。{fast}还是说，你是在等谁吗？』"
    yt "『！！』"
    scene black with fade
    pause 1.0
    scene bg library with fade
    show akane normal2 with dissolve
    akn "『在你后面第二排的那列架子上』"
    yt "『谢谢……』"
    # hide akane with dissolve
    "我非常不好意思地从书架上取了一本《心动魔法》。"
    "我看着她帮我登记，羞愧的心理让我完全不敢抬起头来。"
    "登记完后她把《心动魔法》递给了我，同时在包里掏什么东西。应该是钥匙吧。"
    "我跟着她离开了图书馆。"
    scene bg corridor with dissolve
    show akane normal with dissolve
    "就在她锁完门后，她突然递给了我一本樱花色的笔记本。"
    "上面赫然写着“共感日记”四个大字。"
    akn "『比起你那本《心动魔法》，还是这个更有用，最起码这个是真的』"
    "“真的”？我接过《共感日记》看了一眼。"
    yt "『不用了还是还给你吧』"
    akn "『不，你拿着。这个对你有用，我试过了，放心』"
    hide akane with dissolve
    "她说完就离开了，只剩我和书看着窗外在樱花树下正在沙化的落花。"
    stop music
    # 依照篇幅，此处应有op
    jump chapter_1

label love_mogic:
    n """
    ____________________________________________________________________________{fast}{nw}

    {space=400}{size=*2}【心动魔法】{/size}{nw}

    {space=60}分别在三个纸条上写上在意之人会出现的地方{nw}

    {space=60}摆成三角阵，中间是在意之人喜欢的饮料{nw}

    {space=60}在饮料上放上在意之人的头发{nw}

    {space=60}头发指向哪第二天就能在哪遇到在意之人{nw}

    {space=60}且能搞好关系！{nw}

    ____________________________________________________________________________{fast}
    """
    yt "『这是什么小学生的迷信游戏，不相信』"
    nvl clear
    return

label diary:
    n """
    ____________________________________________________________________________{fast}{nw}
    
    {space=400}{size=*2}【共感日记】{/size}{nw}

    {space=60}『七日为期，寻一人共感，否则一切归零』{nw}

    （手写字迹：）{nw}
    
    {space=60}必须在剩下的七天内与一人完成【共感契约】{nw}

    {space=60}且一起记录下二人间的故事{nw}

    {space=60}才能够获得永远的记忆{nw}

    {space=60}然后能永远在一起{nw}

    ____________________________________________________________________________{fast}
    """
    yt "『虽然也不是很相信，但图书管理员的话确实让人在意』"
    nvl clear
    return

label chapter_1:
    $ f1=0
    play music "家.mp3"
    scene bg home with fade
    "我回到了家里，简单看了一下两本【情｜神】【感｜秘】【偏｜小】【方｜书】。"
    menu:
        "看看《心动魔法》。":
            $ f1=1
            call love_mogic
        "看看《共感日记》。":
            call diary
    
    if f1:
        menu:
            "再看看《共感日记》":
                call diary

    else:
        menu:
            "再看看《心动魔法》":
                call love_mogic

    "先塞书包里面明天还给图书管理员吧。"
    stop music

    scene bg school with fade
    play music "阳光.mp3"
    # 环境描写，樱花的景象与自己对校园的不舍
    "三月的阳光无比温和。"
    "校园里到处都是樱花，风一吹就漫天飞舞。"
    "一想到马上就要毕业了，我的心里也有些许对校园和同学的不舍。"
    "顺带一提，由于马上就要毕业了，这周并不上课。"
    "但还是有一部分同学留在学校里忙着社团的事，以及听老师讲过无数遍的的安全教育。"
    scene bg school2 with dissolve
    "我来到图书馆门口，发现门还没有开。"
    "男の声" "『你书包不放在教室吗？』"
    "学生会的同僚吗。他看起来也是来还书的。"
    yt "『这个嘛，我着急还书就先过来了，没想到门还没开』"
    "同僚" "『书不重吧，等会到学生会肯定又是给其他社团打杂去了』"
    yt "『是啊……其实还好吧……』"
    "如果不是为了和会长相处，谁又乐意待在学生会里打杂呢。"

    scene bg student_council with fade
    stop music
    "我们来到了学生会办公室门口。"
    play music "安静.mp3"
    "我推开门，与平时拥挤的场景不同，办公室里一片寂静。"
    show sakura serious with dissolve
    "只有会长一个人坐在办公桌前，埋头在资料上写写画画，听得见笔尖划过纸张的细微声响。"
    "同僚" "『我们这么早的？』"
    skr "『嗯？你们来晚了』"
    "同僚" "『没有吧，我就刚刚去图书馆还书，发现还没开门就回来了』"
    skr "『所以才晚了啊』"
    "会长对着桌前的一沓资料抬了抬眼睛。"
    skr "『这是你要干的活，园艺社的，最上面那张是我打印出来的工作细则』"
    "同僚" "『好~知道了~~会长大人~~~』"

    scene bg student_council with fade
    show sakura normal with dissolve
    "同僚走了之后，办公室内就只剩下我和会长两个人。"
    "或许是樱花的原因，窗外的风景让会长显得比平常更加神圣。"
    skr "『你怎么还背着包？』"
    yt "『！！哦！哦哦！！好，我我刚刚也是去图书馆忘了！』"
    skr "『你把包拿过来』"
    skr "『你负责田径部的，资料还挺多，拿包来装刚刚好』"
    "我听话地上前把包放在桌上，一只手帮忙扶着书包。"
    skr "『？里面还有书，先拿出来再塞资料吧。诶我刚打印的清单呢』"
    yt "『哦哦好的！！』"
    "等等好个鬼啊！我慌忙地把包拉开，想要赶紧把书拿出来。"
    "可能是方便吧，她先我一步伸手将里面的两本书拿……不对？怎么就一本？还忘了一本在家？"
    "在我慌忙回忆是哪一本时，书在会长的手中微微发光。封面似乎浮现出一行字：“味觉：未同步”。"
    "？？？"
    "是《共感日记》？？？来真的？？"
    "那一缕光也被会长察觉到了，她看了看书封面上的内容。"
    show sakura serious with dissolve
    skr "『味觉？』"
    "她皱了皱眉头。"
    skr "『什么东西？』"
    yt "『哦抱歉是我要还的书我先拿着吧不麻烦您了——』"
    "会长的神色有些奇怪，但手上的工作还没有停。"
    "让我把资料装好后，递给了我一张打印好的工作清单就让我离开了。"

    menu:
        "看一眼工作清单":
                n """
                ____________________________________________________________________________{fast}{nw}

                {space=400}{size=*2}【工作清单】{/size}{nw}

                {space=60}1.将更改学籍的学生资料档案交接给体育部老师{nw}

                {space=60}2.找体育部老师签名确定运动员保送名单{nw}

                {space=60}3.将田径场假期建设资料给到体育老师，保证假期田径部的正常练习{nw}

                {space=60}4.清点田径部器材，上报损坏明细{nw}

                {space=60}5.随便清理一下田径部办公室谢谢{nw}

                ____________________________________________________________________________{fast}
                """
                yt "『……』"
                nvl clear
            
        "工作什么的，还是敬谢不敏了……":
            pass

    "关上门，隐隐约约听见会长在自言自语。"
    skr "『味觉吗，我的……』"

    scene bg field with fade
    play music "风.mp3" fadeout 1.0 fadein 1.0 #要是没有这个BGM，用阳光.mp3也行，但情绪并非那么高昂
    "我来到了田径场，将书包里的资料给到了体育部办公室的老师。"
    "那本《共感日记》就先拿在了手上。"
    "跟老师确定明细时我听见了田径场的跑步声。"

    show aoi happy with dissolve
    "是那个在体育和文化间摇摆不定的小早川葵同学！"
    "之前每次到田径场干活的时候，她都会莫名其妙上来对我冷嘲热讽。"
    "虽然会过来帮忙，但还是很不爽啊怒怒怒（"
    "话说这还是第一次看见她训练诶？"
    hide aoi with dissolve
    "……"
    "在我走神的同时，体育部老师探出头来朝葵喊道。"
    "体育部老师A" "『小早川！过来！』"
    aoi "『好！』"

    # 定义一个 transform 变换，控制移动
    transform move_left_to_center:
        xalign 0.1       # 起始位置（左侧）
        linear 1.0 xalign 0.5  # 用 linear 函数在 2 秒内平移到右侧

    # 展示角色并播放移动动画
    scene bg field with fade
    show aoi none at move_left_to_center
    "看到还有我在体育部办公室，葵这家伙先是不解，随后便装着没看见我走到了老师旁边。"
    stop music
    "体育部老师A" "『呐，你的资料，现在该确定了吧』"
    aoi "『……』"
    "体育部老师A" "『你已经拖了很久了。现在你两方面都考完试了总该确定下来了吧』"
    "嗯？什么事？她要改学籍？"
    aoi "『老师……我还需要想一想……』"
    "体育部老师A" "『你还有多久时间？剩六七天了，现在人家都过来了，你为难我也别为难他啊』"
    show aoi serious with dissolve
    aoi "『……！』"
    "小早川葵突然朝我瞪了一眼，但她的事好像依旧没有确定。"
    show aoi none with dissolve
    yt "『啊，老师，这。这个也还不是很急，因为我后面几天也会来。老师先签名一下这个吧』"
    "我帮忙着打圆场，老师也把态度放了放，顺着拿了我手上的名单。"
    "体育部老师A" "『……』"
    "体育部老师A" "『再给你两天，后天我就确定了，就不管你了，你自己看着办』"
    show aoi none2 with dissolve #最理想的：2都代表闭眼差分
    aoi "『……嗯』"
    show aoi none with dissolve
    "看样子暂时是没问题了，我将剩下的资料堆好在老师桌上。"
    yt "『那老师我就先去清点一下器材室的器材咯』"
    "体育部老师A" "『小早川去搭把手』"
    show aoi none with dissolve
    aoi "『。好』"

    scene bg lab with fade
    show aoi serious with dissolve
    "刚进器材室，葵就伸手把我手上的笔记本连同清单一起抽走。"
    show aoi angry
    aoi "『你就是过来找我麻烦的吗？』"
    play music "神秘.mp3"
    show aoi surprise
    "还没等我回答，笔记本不出意外也发出了光，并且在封闭的器材室更加明显。"
    show aoi serious with dissolve
    aoi "『这是什么啊？』"
    "她刚翻看着几页，手却突然像被电击般抽走，书掉落在地上。"
    yt "『嗨！干嘛？』"
    "她用手捂着肩胛骨的位置，延续了在老师那时的沉默。"
    aoi "『嘶。随便你，你自己干吧软脚虾』"

    # 向右退场
    transform move_out_right:
        xalign 0.5 #从中间
        linear 1.0 xalign 1.2 alpha 0.0  #移动到右侧

    show aoi serious at move_out_right
    with AlphaDissolve(move_out_right, delay=1.0, reverse=True) #向右渐隐移动
    
    "说着就跑出去了，剩下我捡起地上的书。"
    
    scene bg classroom with fade
    play music "风.mp3" fadeout 1.0 fadein 1.0
    "上午一个人清点了器材室的所有器材，期间还帮老师顺手建了个表格。"
    "工作量之大让我不得不牺牲掉午餐时间，虽然还是没清点完。"
    "体育部老师A让我明天继续。"
    "我打开饭盒，准备在教室里享受午餐。"
    "这时却有人叫我。"
    "classmate" "『阳太，你今天上午没去天文社啊』"
    yt "『额……嗯，我没去，我去学生会了』"
    "classmate" "『上午天文社的同学让我叫你一回来就去天文社，说事挺急的』"
    yt "『啊——别吧——』"
    "我关上还没吃几口的饭盒，书包还没放下来就又走了。"
    yt "（本来还想着去图书馆呢……）"

    scene bg bad_room with fade
    play music "平静.mp3" fadeout 1.0 fadein 1.0
    yt "『你好，有人吗？』"
    "我敲了敲一如既往阴森的社团活动室。"
    "由于天文社主要是室外观测，再加上天台有人失足掉下去后就被封住了。"
    "学校只能安排天文社在最高楼层的教室，之前还是杂物室来着。"
    "室外观测也只是去学校现在楼花漫天的小树林里面的小土包上面。"
    "反正就是天文社活动室阴森森的。每次我来都是要人打扫卫生打杂之类。"
    yt "（那看样子是没人了）"
    "？？？" "『喀哒，喀哒……』"
    yt "『我靠什么鬼！！』"
    "我吼道，每次都有这种奇奇怪怪的声音出现。"
    "？？？" "『……喀哒，喀哒……』"
    "貌似是按动笔的声音？从那群纸箱子里传来的……"
    yt "『说话，喂！』"
    "？？？" "『……』"
    "我将书包脱下，往纸箱子那里砸过去。"
    show ai normal #可以立绘下移
    "稀稀拉拉掉下来的纸箱下，露出来的是竟然是雾岛蓝同学的头。"
    yt "『……你是笨蛋吗』"
    yt "『雾岛蓝同学』"
    show ai normal with dissolve #移动到原位
    ai "『怎么了，不尖叫了？还吓的你要扔书包』"
    "雾岛蓝是天文部的幽灵社员，说话声音很小。我虽然很无语，但也还是压低了声音。"
    yt "『算了。社长有什么事？』"
    "雾岛蓝拿起了从我书包里掉出来的《共感日记》。我来的很急，所以书包拉链还没关。"
    ai "『果然……』"
    yt "『什么？』"
    "本子又在雾岛蓝的接触下发光了，上面又浮现出其他的字样。"
    "我下意识地想上去把本子拿回来却扑了个空。"
    ai "『社长叫你打扫教室，然后拿块干净干燥的布把天文望远镜盖上』"
    yt "『那你现在能把本子还给我了吗？』"
    ai "『你还要把这些箱子给整理回来，等你干完了我再还你』"
    "雾岛蓝用按动笔指着我，要不是环境很安静我都不一定听得见她很小的声音。"
    
    scene bg bad_room with fade
    play music "平静.mp3" fadeout 1.0 fadein 1.0
    show ai none with dissolve
    "可能是我干活的同时一直在盯着雾岛蓝同学，又或许是那本子里除了第一页其他都是空白页没什么可看的。"
    "雾岛蓝在我干活中途就把本子塞给我让我出去了。"
    ai "『社长说这些是你这几天的工作。我要记录星空的声音。你先走吧』"
    "很莫名其妙的一个人，但看样子，她应该知道一些关于本子的事。"
    hide ai with dissolve
    "正想着，我已经被赶出天文教室了，还有书包。"
    "然后就是她按动笔的声音『喀哒，喀哒……』"
    "那是录音笔还是在接收电波啊，声音还比一开始大声了些。"
    
    scene bg school2 with fade
    "在天文数室待的也快放学了。"
    "我跑去图书馆，发现图书馆也关门了。"
    "我找不到图书管理员，只得先回家。"
    scene bg street with dissolve
    "路上经过了校门附近开的甜品店，看见里面开开心心的jk。"
    yt "（下次，可以的话，试着约会长出来吧。）"
    
    scene bg home with fade
    stop music
    n """
    ____________________________________________________________________________{fast}{nw}
    
    {space=400}{size=*2}【共感日记】{/size}{nw}

    {space=60}“味觉 未同步”：故事A1{nw}
    
    {space=60}“触觉 未同步”：故事B1{nw}

    {space=60}“听觉 微弱同步”：故事C1{nw}

    ____________________________________________________________________________{fast}
    """
    yt "『不仅封面更新了，内页也更新了啊……』"
    nvl clear
    scene black with Dissolve(2.5)

    jump chapter_2

label chapter_2:
    stop music

    return
